package generics;

/*
Создать функцию, в которую передается либо символьное, либо строковое
значение, после чего вычисляется и возвращается код символа, либо сумма кодов
символов.
 */
public class task5 {
    public static void main(String[] args) {
        char c = 'F';
        char c1 = 'G';
        System.out.println((int) c + (int) c1);
    }


}
